stefaema/STEF/firmware/src/sdkconfig.defaults
# The part is an ESP32-S3.
CONFIG_IDF_TARGET="esp32s3"

# Console on the UART bridge ("COM"), native USB carries nothing but RPC
# frames. A panic has to land on a port that is not itself re-enumerating.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Board's real flash (confirmed via esptool flash_id) is 16MB; ESP-IDF's
# default of 2MB was silently truncating what the bootloader thought was
# available.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
